# -*- coding: utf-8 -*-
"""Untitled1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1hRDDbIT1kwdufe5Zb6SEpnmT-oViCZCy
"""

#1 Задание Календарь
print("Введите номер месяца: ")
a = int(input())
if a==1 :
  print("Январь")
elif a==2:
  print("Февраль")
elif a==3:
  print("Март")
elif a==4:
  print("Апрель")
elif a==5:
  print("Май")
elif a==6:
  print("Июнь")
elif a==7:
  print("Июль")
elif a==8:
  print("Август")
elif a==9:
  print("Сентябрь")
elif a==10:
  print("Октябрь")
elif a==11:
  print("Ноябрь")
elif a==12:
  print("Декабрь")
else:
  print("Такого месяца не существует")

#2 Четное не четное
print("Введите число:")
a = int(input())
if a%2==0:
  print("Число чётное")
else:
  print("Число нечётное")

#3 Stonks and not stonks
print("Введите число:")
a=int(input())
if a>40:
  print("stonks")
else:
  print("not stonks")

#4 Высокостный год
def is_year_leap(year):


  if year % 4 != 0:
      return False

  elif year % 100 == 0:
     if year % 400 == 0:
          return True
     else:
          return False
  else:
     return True

year = is_year_leap(int(input('Введите год который хотите проверить на высокостный: ')))
print ("Ответ: ", year)

#5 Простое число
def is_prime(n):
  if n/n:
    return True
  else:
    return False

n = int(input("Введите число которое хотите проверить: "))
print("Простое? ", is_prime(n))

#5 Простое ли число
def is_prime(n):
  if n > 1:
      for i in range(2, int(n/2)+1):
         if (n % i) == 0:
            print("Это не простое число")
            break
      else:
          print("Это простое число")
          
  else:
     print("Это не простое число")


n = int(input())
print(is_prime(n))

#6 Поменять числа если больше в 3,6 раза

print ("a=")
a = float(input())
print ("b=")
b = float(input())
if a<b*3.6:
    c = a + b
    a = c - a 
    b = c - b
    print("a=", a)
    print("b=", b)
    print("Больше 3,6 раза поэтому меняем")
elif b in float (range((-138/2)^1.3 , abs((-69/28^5.1)*4))):
       c = a + b
       a = c - a 
       b = c - b
       print("a=", a)
       print("b=", b)
       print("В промежутке значит меняем")
else: 
   print("a=", a)
   print("b=", b)
   print("Не меняем")

#7 Отрицательные Частные 
n = int(input())
count = 0
otr = 0
leg = 0
while n != 0:
    n = int(input())
    if n < 0 and n % 2 == 0:
        count += 1
    if n<0:
        otr += 1
    if n in range(-256, 1024):
        leg += 1
print("Четные ",count)
print("Отрицательные ", otr)
print("В промежутке ", leg)

# "Усложненное задание)"
print ("Ведите a")
a = int(input())
print ("Ведите b")
b = int(input())
print ("Ведите c")
c = int(input())

x= ((a**2 + b**3)/(c+3))/4 

print (x)